{
  "game_intro": [
  "\n─── A world Unknown ───\n",
  "You were just living your ordinary life when suddenly—",
  "The sky above **shattered**.",
  "Darkness swallowed you whole, and you felt yourself falling… endlessly.",
  "",
  "When you awaken, you are **not home**.",
  "A world unfamiliar stretches before you—ruined, burdened by a **great disaster**.",
  "Figures surround you, clad in robes, chanting words you do not understand.",
  "Then, a voice booms in your mind:",
  "",
  "**‘You have been chosen. The Waves will come. Stand, and fight... or all will be lost.**"
 
  ],


  "History": [

  "Long ago, the world was prosperous and united, its people thriving under the rule of four great kingdoms.",
  "Each kingdom was protected by a Legendary Hero, a warrior blessed with divine power to fight against the Waves—horrific calamities that brought forth monstrous creatures, threatening to consume everything.",
  "",
  "But as centuries passed, the heroes faded into legend, their names lost to time. Now, the Waves have returned, and with them, a prophecy:",
  "",
  "'When darkness looms once more, four champions shall rise—",
  "Bound by fate, wielders of steel, unknowing saviors of the realm.",
  "They shall be summoned from a distant world, bearing the arms of legends,",
  "And in their hands, the fate of the kingdom shall rest.'",
  "",
  "And so, you were summoned, bound by destiny to take the mantle of one of these legendary warriors…"
  ],

  "hero_awakening": [
    "As your senses return, you feel a strange weight pressing against your arm.",
    "You look down—clutched in your grasp is a **{hero_type}'s weapon**.",
    "It feels natural, yet completely foreign.",
    "Confusion fills your mind. What is this place? Why are you here?",
    "You turn to the robed figures, demanding answers."
  ],



 "robed_figure_explanation": [
    "**Robed Figure:** 'You do not yet understand, do you?'",
    "He steps forward, his voice calm yet firm.",
    "",
    "**Robed Figure:** 'You have been chosen as one of the Four Legendary Heroes.'",
    "His words feel heavy, but they offer little clarity.",
    "",
    "**Robed Figure:** 'Each hero wields a sacred weapon: the Sword, the Spear, the Bow, or the Shield.'",
    "Each weapon grant unique abilities"
   
  ],


  "Shield Hero": [
   
    "A defensive powerhouse, the Shield Hero excels in protecting allies and absorbing damage.",
    "With a strong defense and the ability to block attacks, this hero is the ideal choice for players who prefer a supportive and resilient role in battle."

  ],
  "Sword Hero": [
    "A master of offense, the sword Hero deals powerful melee attacks.",
    "Quick and deadly, this hero is perfect for players who love higher-damage combat."
  ],
  "Spear Hero": [
    "A balanced Warrior with a long reach, the spear Hero can strick enemies form a distance.",
    "A great choice for those who enhoy versatility and a mix of attack and defense. "
  ],
  "Bow Hero":[
    "A rangeed speciality, the Bow Hero excels in long distance combat.",
    "Iddeal for strategic players who prefer to fight from afar while avoiding direct confrontation"
  ],
  "Stranger": [
   "But there's no time to celebrate—danger is upon us.",
   "A monstrous wave is approaching, and we need you to stand strong!",
   "Prepare yourself! The moment it begins, you'll be transported to the battlefield."
  ]

}

